Revit 2024 API
CurveUV Methods
The CurveUV type exposes the following members.
Methods
Name | Description
As3DCurveInXYPlane
 Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.
ComputeDerivatives
 Computes the first derivative, the second derivative and the unit tangent vector at the specified parameter along the curve.
Create
 Create a CurveUV from a bounded 3D Curve lying in the XY plane.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Evaluate
 Evaluates and returns the point at the specified parameter along the curve.
GetEndParameter
 Gets the raw parameter value at the start or end of this curve.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Transform
 Transform this CurveUV by the given 2D affine transform if possible.
See Also
CurveUV Class
Autodesk.Revit.DB Namespace